MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX254F128B.PIC
      <edc:SFRDef edc:_addr="0x1F886120" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnn---nnn-nnnnnn" edc:cname="PORTB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffe3bf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxx---xxx-xxxxxx" edc:name="PORTB" edc:nzwidth="0x20" edc:por="----------------xxx---xxx-xxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB8" edc:desc="" edc:mask="0x1" edc:name="RB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB9" edc:desc="" edc:mask="0x1" edc:name="RB9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RB13" edc:desc="" edc:mask="0x1" edc:name="RB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB14" edc:desc="" edc:mask="0x1" edc:name="RB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB15" edc:desc="" edc:mask="0x1" edc:name="RB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886130" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnn---nnn-nnnnnn" edc:cname="LATB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffe3bf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxx---xxx-xxxxxx" edc:name="LATB" edc:nzwidth="0x20" edc:por="----------------xxx---xxx-xxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB8" edc:desc="" edc:mask="0x1" edc:name="LATB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATB9" edc:desc="" edc:mask="0x1" edc:name="LATB9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATB13" edc:desc="" edc:mask="0x1" edc:name="LATB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATB14" edc:desc="" edc:mask="0x1" edc:name="LATB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB15" edc:desc="" edc:mask="0x1" edc:name="LATB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886140" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnn---nnn-nnnnnn" edc:cname="ODCB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffe3bf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000---000-000000" edc:name="ODCB" edc:nzwidth="0x20" edc:por="----------------000---000-000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCB0" edc:desc="" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB1" edc:desc="" edc:mask="0x1" edc:name="ODCB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB2" edc:desc="" edc:mask="0x1" edc:name="ODCB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB3" edc:desc="" edc:mask="0x1" edc:name="ODCB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB4" edc:desc="" edc:mask="0x1" edc:name="ODCB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB5" edc:desc="" edc:mask="0x1" edc:name="ODCB5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCB7" edc:desc="" edc:mask="0x1" edc:name="ODCB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB8" edc:desc="" edc:mask="0x1" edc:name="ODCB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCB9" edc:desc="" edc:mask="0x1" edc:name="ODCB9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCB13" edc:desc="" edc:mask="0x1" edc:name="ODCB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCB14" edc:desc="" edc:mask="0x1" edc:name="ODCB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB15" edc:desc="" edc:mask="0x1" edc:name="ODCB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
